epicgrowers/kcdevice/config/sdkconfig.defaults
# Bluetooth configuration (based on ESP-IDF v5.5 examples)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# WiFi configuration
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y

# NVS Storage
# NVS encryption enabled for secure credential storage
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECTION_SCHEME=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_FLASH_ENC=n
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FATFS
CONFIG_FATFS_LFN_STACK=y

# Log levels
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Flash Encryption - DISABLED for development flexibility
# Keeping flash unencrypted allows unlimited reflashing during development
# NVS encryption alone provides MEDIUM security for WiFi credentials
# Uncomment below to enable (WARNING: IRREVERSIBLE, limits reflashing)
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
# CONFIG_SECURE_FLASH_REQUIRE_ALREADY_ENABLED=n
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_ENC=y
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_DEC=y
CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_CACHE=y

# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
